{
  "name": "Sharath Vignesh 🙇🏻",
  "address": "Tokyo, Japan 🗻 ",
  "email": "sharathvignesh08@gmail.com",
  "mobile": "+81 9092027800",
  "about": "Application architecture & full stack development",
  "language": "English (Business proficiency), Japanese (JLPT N3 certified), Tamil (Native proficiency)",
  "skills": {
    "language": "Typescript, Javascript",
    "frameworks": "ReactJS ecosystem, AWS CDK, NodeJS, tRPC, GraphQL, NextJS",
    "database": "Postgres, DynamoDB, MondoDB, Redis",
    "cloud": "AWS, firebase",
    "tools": "Git, Contentful, Cypress, Kibana, Parcel, Atlassian",
    "misc": "CCNA, FFMPEG, DashJS, SDN, Stressless streaming, Unix"
  },
  "experience": [
    {
      "position": "Software Engineer III",
      "organization": "Asurion",
      "location": "Tokyo, Japan",
      "year": "November 2018 - present",
      "description": [
        "Hands on experience in end-to-end architecture and development for multiple projects, including database design, tech stack selection, and system design, delivering both internal and external applications. (AWS stack)",
        "Actively exploring Generative AI to identify use cases, develop rapid POCs, and showcase value to stakeholders and customers. (AWS Kendra, Langchain)",
        "Led Japan-specific customizations and implementation for the Google Insurance project, collaborating with global team to ensure a successful launch and steady growth.",
        "Proactively addressed critical and high-risk security vulnerabilities across a spectrum of applications, ensuring robust security posture for Japan region applications.",
        "Orchestrated multifaceted cloud optimizations spanning diverse applications, fostering seamless collaboration across multiple teams for enhanced performance and efficiency.",
        "Planned and implemented a cost effective Github CI/CD workflow(automated lint, cypress integration tests, unit tests, typescript check & semantic release) for applications from scratch.",
        "Lead the UI team involving on-site as well as offshore developers on call center application for some of the biggest clients in Japan. (Stack: AWS Infra, React, Redux, Typescript).",
        "Lead the efforts for TDD across diffeent projects, improving the test coverage from 10% to 52%, ultimately improving quality across projects."
      ]
    },
    {
      "position": "R&D Engineer",
      "organization": "Fuji Xerox",
      "location": "Yokohama, Japan",
      "year": "Aug 2016 - October 2018",
      "description": [
        "Researched and solved a generic problem with respect to video streaming that enhances the QoE for the viewers.",
        "Contributed to the patent (JP-2020-028084) for a remote conference system that differentiates group audio output.",
        "Developed a client side application (using ReactJS, SocketIO) for real time Doctor recommendation system.",
        "Test driven development of a Mulitmedia platform API (using nodeJS, MochaJS, Postgres) that processes the videos uploaded by the users.",
        "Developing a IoT application to track employees in a company (Indoor localisation, voice & schedule). Uses react-native, Mongodb, nodeJS, SocketIO.",
        "Developed a client side video portal with various analytics features (using ReactJS, DashJS, nodeJS, Mongodb)."
      ]
    }
  ],
  "education": [
    {
      "name": "SSN College of Engineering",
      "degree": "B.E Computer Science",
      "year": "2012 - 2016",
      "description": [
        "Head of SSN ACM Student Chapter web development team",
        "Head of Instincts Tech team 2015"
      ]
    }
  ],
  "patentsAndBlogs": [
    {
      "name": "Remote conference system",
      "link": "https://www.j-platpat.inpit.go.jp/c1800/PU/JP-2020-028084/C74AAD2005091BD651EE3E7CAC9105FE36DE76FCFE462271A87D85073A8C03B6/11/ja"
    },
    {
      "name": "Tech blogs",
      "link": "https://sharathvignesh.medium.com/"
    }
  ],
  "projects": [
    {
      "name": "Posted",
      "role": "Creator / Developer",
      "description": "📝 Beautiful product update (what's new) pages for your product.(uses ReactJS, nodeJS, Mongodb, JWT)",
      "link": "https://github.com/sharathvignesh/Posted-CMS"
    },
    {
      "name": "whatsMyFood",
      "role": "Front end developer",
      "description": "Simple iOS app to remember the good and bad food that we ate at various restaurants. (uses React native, serverless, firebase)",
      "link": "https://github.com/sharathvignesh/whatsMyFood"
    },
    {
      "name": "Coming-or-not",
      "role": "Full stack developer",
      "description": "An event planning system that is aimed to ease the work of event planners/organizers (uses ReactJS, Redux, serverless, GraphQL)",
      "link": "https://github.com/lakshmantgld/comingOrNot"
    }
  ],
  "contacts": {
    "twitter": "https://twitter.com/sharathvignesh",
    "github": "https://github.com/sharathvignesh",
    "linkedin": "https://www.linkedin.com/in/sharathvignesh/"
  }
}
